app/views/people/show.html.erb


<h2><%= @person.working_tasks.length %> <%= link_to 'tasks', "/people/#{@person.id}/tasks" %> left.</h2>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."person_id" = ?  [["person_id", 1]]