app/controllers/people_controller.rb

  def tasks
    id = params[:id]
    @tasks = Person.find(id).sorted_tasks
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."person_id" = ?  [["person_id", 1]]