app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE (completed_at < '2015-11-13 19:12:45.191618')
---
	def index
		@tasks = Task.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		id = params[:id]
		@task = Task.find(id)

INSERT INTO "tasks" ("name", "description", "person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "new task"], ["description", "something else "], ["person_id", 2], ["created_at", "2015-11-16 21:31:08.184361"], ["updated_at", "2015-11-16 21:31:08.184361"]]
---
	def create
		Task.create(task_params[:task])

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
	def destroy
		Task.find(params[:id]).destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "tasks" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", nil], ["description", nil], ["updated_at", "2015-11-13 20:21:54.748877"], ["id", 5]]
---
	def update
		@task = Task.find(params[:id])
		if params[:completed] == "true"
			@task.update(:completed_at => Time.now)