app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE ("tasks"."completed_at" != ?)  [["completed_at", "NULL"]]
---
  def index
    @title = "Task List"
    @tasks = Task.all.order(:completed_at)